alexhorner/ch32v003fun/minichlink/minichlink.c
// The "bootloader" blob is (C) WCH.
// The rest of the code, Copyright 2023 Charles Lohr
// Freely licensable under the MIT/x11, NewBSD Licenses, or
// public domain where applicable. 

// TODO: Can we make a unified DMPROG for reading + writing?

#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include "minichlink.h"
#include "../ch32v003fun/ch32v003fun.h"

#if defined(WINDOWS) || defined(WIN32) || defined(_WIN32)
#define DISABLE_ARDULINK
void Sleep(uint32_t dwMilliseconds);
#else
#include <unistd.h>
#endif

//#define CHUNKSIZE 64
#define CHUNKSIZE 256
//#define CHUNKSIZE 128

static int64_t StringToMemoryAddress( const char * number ) __attribute__((used));
static void StaticUpdatePROGBUFRegs( void * dev ) __attribute__((used));
static int InternalUnlockBootloader( void * dev ) __attribute__((used));
int DefaultReadBinaryBlob( void * dev, uint32_t address_to_read_from, uint32_t read_size, uint8_t * blob );

void TestFunction(void * v );
struct MiniChlinkFunctions MCF;

static void DumpDebugRegs(void* dev)
{
	int temp;

	/*MCF.ReadReg32(dev, DMDATA0, &temp);
	fprintf(stderr, "DMDATA0: %08x\n", temp);

	MCF.ReadReg32(dev, DMDATA1, &temp);
	fprintf(stderr, "DMDATA1: %08x\n", temp);

	MCF.ReadReg32(dev, DMCONTROL, &temp);
	fprintf(stderr, "DMCONTROL: %08x\n", temp);*/
	
	MCF.ReadReg32(dev, DMSTATUS, &temp);
	fprintf(stderr, "DMSTATUS: %08x\n", temp);

	/*MCF.ReadReg32(dev, DMHARTINFO, &temp);
	fprintf(stderr, "DMHARTINFO: %08x\n", temp);*/

	MCF.ReadReg32(dev, DMABSTRACTCS, &temp);
	fprintf(stderr, "DMABSTRACTCS: %08x\n", temp);

	/*MCF.ReadReg32(dev, DMCOMMAND, &temp);
	fprintf(stderr, "DMCOMMAND: %08x\n", temp);

	MCF.ReadReg32(dev, DMABSTRACTAUTO, &temp);
	fprintf(stderr, "DMABSTRACTAUTO: %08x\n", temp);

	MCF.ReadReg32(dev, DMPROGBUF0, &temp);
	fprintf(stderr, "DMPROGBUF0: %08x\n", temp);

	MCF.ReadReg32(dev, DMPROGBUF1, &temp);
	fprintf(stderr, "DMPROGBUF1: %08x\n", temp);

	MCF.ReadReg32(dev, DMPROGBUF2, &temp);
	fprintf(stderr, "DMPROGBUF2: %08x\n", temp);

	MCF.ReadReg32(dev, DMPROGBUF3, &temp);
	fprintf(stderr, "DMPROGBUF3: %08x\n", temp);

	MCF.ReadReg32(dev, DMPROGBUF4, &temp);
	fprintf(stderr, "DMPROGBUF4: %08x\n", temp);

	MCF.ReadReg32(dev, DMPROGBUF5, &temp);
	fprintf(stderr, "DMPROGBUF5: %08x\n", temp);

	MCF.ReadReg32(dev, DMPROGBUF6, &temp);
	fprintf(stderr, "DMPROGBUF6: %08x\n", temp);

	MCF.ReadReg32(dev, DMPROGBUF7, &temp);
	fprintf(stderr, "DMPROGBUF7: %08x\n", temp);

	MCF.ReadReg32(dev, DMCPBR, &temp);
	fprintf(stderr, "DMCPBR: %08x\n", temp);

	MCF.ReadReg32(dev, DMCFGR, &temp);
	fprintf(stderr, "DMCFGR: %08x\n", temp);

	MCF.ReadReg32(dev, DMSHDWCFGR, &temp);
	fprintf(stderr, "DMSHDWCFGR: %08x\n", temp);*/
}

void * MiniCHLinkInitAsDLL( struct MiniChlinkFunctions ** MCFO )
{
	void * dev = 0;
	if( (dev = TryInit_WCHLinkE()) )
	{
		fprintf( stderr, "Found WCH Link\n" );
	}
	else if( (dev = TryInit_ESP32S2CHFUN()) )
	{
		fprintf( stderr, "Found ESP32S2 Programmer\n" );
	}
	else if ((dev = TryInit_NHCLink042()))
	{
		fprintf( stderr, "Found NHC-Link042 Programmer\n" );
	}

#ifndef DISABLE_ARDULINK
	else if ((dev = TryInit_Ardulink()))
	{
		fprintf( stderr, "Found Ardulink Programmer\n" );
	}
#endif
	else
	{
		fprintf( stderr, "Error: Could not initialize any supported programmers\n" );
		return 0;
	}

	SetupAutomaticHighLevelFunctions( dev );
	if( MCFO )
	{
		*MCFO = &MCF;
	}
	return dev;
}

#if !defined( MINICHLINK_AS_LIBRARY ) && !defined( MINICHLINK_IMPORT )
int main( int argc, char ** argv )
{
	if( argc > 1 && argv[1][0] == '-' && argv[1][1] == 'h' )
	{
		goto help;
	}
	void * dev = MiniCHLinkInitAsDLL( 0 );
	if( !dev )
	{
		fprintf( stderr, "Error: Could not initialize any supported programmers\n" );
		return -32;
	}

	int status;
	int must_be_end = 0;

	int skip_startup = 
		(argc > 1 && argv[1][0] == '-' && argv[1][1] == 'u' ) |
		(argc > 1 && argv[1][0] == '-' && argv[1][1] == 'h' ) |
		(argc > 1 && argv[1][0] == '-' && argv[1][1] == 't' ) |
		(argc > 1 && argv[1][0] == '-' && argv[1][1] == 'f' ) |
		(argc > 1 && argv[1][0] == '-' && argv[1][1] == 'X' );

	if( !skip_startup && MCF.SetupInterface )
	{
		if( MCF.SetupInterface( dev ) < 0 )
		{
			fprintf( stderr, "Could not setup interface.\n" );
			return -33;
		}
		printf( "Interface Setup\n" );

		int temp;
		MCF.ReadReg32(dev, DMSTATUS, &temp);
		fprintf(stderr, "DMSTATUS: %08x\n", temp);

		MCF.ReadReg32(dev, DMABSTRACTCS, &temp);
		fprintf(stderr, "DMABSTRACTCS: %08x\n", temp);
	}

//	TestFunction( dev );

	int iarg = 1;
	const char * lastcommand = 0;
	for( ; iarg < argc; iarg++ )
	{
		char * argchar = argv[iarg];

		lastcommand = argchar;
		if( argchar[0] != '-' )
		{
			fprintf( stderr, "Error: Need prefixing - before commands\n" );
			goto help;
		}
		if( must_be_end )
		{
			fprintf( stderr, "Error: the command '%c' cannot be followed by other commands.\n", must_be_end );
			return -1;
		}
		
keep_going:
		switch( argchar[1] )
		{
			default:
				fprintf( stderr, "Error: Unknown command %c\n", argchar[1] );
			case 'h':
				goto help;
			case '3':
				if( MCF.Control3v3 )
					MCF.Control3v3( dev, 1 );
				else
					goto unimplemented;
				break;
			case '5':
				if( MCF.Control5v )
					MCF.Control5v( dev, 1 );
				else
					goto unimplemented;
				break;
			case 't':
				if( MCF.Control3v3 )
					MCF.Control3v3( dev, 0 );
				else
					goto unimplemented;
				break;
			case 'f':
				if( MCF.Control5v )
					MCF.Control5v( dev, 0 );
				else
					goto unimplemented;
				break;
			case 'u':
				if( MCF.Unbrick )
					MCF.Unbrick( dev );
				else
					goto unimplemented;
				break;
			case 'U':
				// Unlock Bootloader
				if( InternalUnlockBootloader( dev ) )
					goto unimplemented;
				break;
			case 'b':  //reBoot
				if( !MCF.HaltMode || MCF.HaltMode( dev, 1 ) )
					goto unimplemented;
				break;
			case 'B':  //reBoot into Bootloader
				if( !MCF.HaltMode || MCF.HaltMode( dev, 3 ) )
					goto unimplemented;
				break;
			case 'e':  //rEsume
				if( !MCF.HaltMode || MCF.HaltMode( dev, 2 ) )
					goto unimplemented;
				break;
			case 'E':  //Erase whole chip.
				if( MCF.HaltMode ) MCF.HaltMode( dev, 0 );
				if( !MCF.Erase || MCF.Erase( dev, 0, 0, 1 ) )
					goto unimplemented;
				break;
			case 'a':
				if( !MCF.HaltMode || MCF.HaltMode( dev, 0 ) )
					goto unimplemented;
				break;
			case 'A':  // Halt without reboot
				if( !MCF.HaltMode || MCF.HaltMode( dev, 5 ) )
					goto unimplemented;
				break;

			// disable NRST pin (turn it into a GPIO)
			case 'd':  // see "RSTMODE" in datasheet
				if( MCF.HaltMode ) MCF.HaltMode( dev, 0 );
				if( MCF.ConfigureNRSTAsGPIO )
					MCF.ConfigureNRSTAsGPIO( dev, 0 );
				else
					goto unimplemented;
				break;
			case 'D': // see "RSTMODE" in datasheet
				if( MCF.HaltMode ) MCF.HaltMode( dev, 0 );
				if( MCF.ConfigureNRSTAsGPIO )
					MCF.ConfigureNRSTAsGPIO( dev, 1 );
				else
					goto unimplemented;
				break;
			case 'p': 
				if( MCF.HaltMode ) MCF.HaltMode( dev, 0 );
				if( MCF.ConfigureReadProtection )
					MCF.ConfigureReadProtection( dev, 0 );
				else
					goto unimplemented;
				break;
			case 'P':
				if( MCF.HaltMode ) MCF.HaltMode( dev, 0 );
				if( MCF.ConfigureReadProtection )
					MCF.ConfigureReadProtection( dev, 1 );
				else
					goto unimplemented;
				break;
			case 'G':
			case 'T':
			{
				if( !MCF.PollTerminal )
					goto unimplemented;

