alexhorner/ch32v003fun/minichlink/minichlink.c
	uint32_t rr;
	ret |= MCF.ReadReg32( dev, DMDATA0, &rr );
	*data = rr;
	return ret;
}


static int DefaultWriteWord( void * dev, uint32_t address_to_write, uint32_t data )
{
	struct InternalState * iss = (struct InternalState*)(((struct ProgrammerStructBase*)dev)->internal);
	int ret = 0;

	int is_flash = 0;
	if( ( address_to_write & 0xff000000 ) == 0x08000000 || ( address_to_write & 0x1FFFF800 ) == 0x1FFFF000 )
	{
		// Is flash.
		is_flash = 1;
	}

	if( iss->statetag != STTAG( "WRSQ" ) || is_flash != iss->lastwriteflags )
	{
		int did_disable_req = 0;
		if( iss->statetag != STTAG( "WRSQ" ) )
		{
			MCF.WriteReg32( dev, DMABSTRACTAUTO, 0x00000000 ); // Disable Autoexec.
			did_disable_req = 1;
			// Different address, so we don't need to re-write all the program regs.
			// c.lw x9,0(x11) // Get the address to write to. 
			// c.sw x8,0(x9)  // Write to the address.
			MCF.WriteReg32( dev, DMPROGBUF0, 0xc0804184 );
			// c.addi x9, 4
			// c.sw x9,0(x11)
			MCF.WriteReg32( dev, DMPROGBUF1, 0xc1840491 );

			if( iss->statetag != STTAG( "RDSQ" ) )
			{
				StaticUpdatePROGBUFRegs( dev );
			}
		}

		if( iss->lastwriteflags != is_flash || iss->statetag != STTAG( "WRSQ" ) )
		{
			// If we are doing flash, we have to ack, otherwise we don't want to ack.
			if( is_flash )
			{
				// After writing to memory, also hit up page load flag.
				// c.sw x13,0(x12) // Acknowledge the page write.
				// c.ebreak
				MCF.WriteReg32( dev, DMPROGBUF2, 0x9002c214 );
			}
			else
			{
				MCF.WriteReg32( dev, DMPROGBUF2, 0x00019002 ); // c.ebreak
			}
		}

		MCF.WriteReg32( dev, DMDATA1, address_to_write );
		MCF.WriteReg32( dev, DMDATA0, data );

		if( did_disable_req )
		{
			MCF.WriteReg32( dev, DMCOMMAND, 0x00271008 ); // Copy data to x8, and execute program.
			//MCF.WriteReg32( dev, DMCOMMAND, 0x00261000 );
			MCF.WriteReg32( dev, DMABSTRACTAUTO, 1 ); // Enable Autoexec.
		}
		iss->lastwriteflags = is_flash;

		iss->statetag = STTAG( "WRSQ" );
		iss->currentstateval = address_to_write;

		if( is_flash )
		{
			ret |= MCF.WaitForDoneOp( dev, 0 );
			if( ret ) fprintf( stderr, "Fault on DefaultWriteWord Part 1\n" );
		}
	}
	else
	{
		if( address_to_write != iss->currentstateval )
		{
			MCF.WriteReg32( dev, DMABSTRACTAUTO, 0 ); // Disable Autoexec.
			MCF.WriteReg32( dev, DMDATA1, address_to_write );
			MCF.WriteReg32( dev, DMABSTRACTAUTO, 1 ); // Enable Autoexec.
		}
		MCF.WriteReg32( dev, DMDATA0, data );
		if( is_flash )
		{
			// XXX TODO: This likely can be a very short delay.
			// XXX POSSIBLE OPTIMIZATION REINVESTIGATE.
			ret |= MCF.WaitForDoneOp( dev, 0 );
			if( ret ) fprintf( stderr, "Fault on DefaultWriteWord Part 2\n" );
		}
		else
		{
			ret |= MCF.WaitForDoneOp( dev, 0 );
			if( ret ) fprintf( stderr, "Fault on DefaultWriteWord Part 3\n" );
		}
	}


	iss->currentstateval += 4;

	return ret;
}

int DefaultWriteBinaryBlob( void * dev, uint32_t address_to_write, uint32_t blob_size, uint8_t * blob )
{
	// NOTE IF YOU FIX SOMETHING IN THIS FUNCTION PLEASE ALSO UPDATE THE PROGRAMMERS.
	//  this is only fallback functionality for really realy basic programmers.

	uint32_t rw;
	struct InternalState * iss = (struct InternalState*)(((struct ProgrammerStructBase*)dev)->internal);
	int is_flash = 0;

	if( blob_size == 0 ) return 0;

	if( (address_to_write & 0xff000000) == 0x08000000 || (address_to_write & 0xff000000) == 0x00000000 || (address_to_write & 0x1FFFF800) == 0x1FFFF000 ) 
		is_flash = 1;

	// We can't write into flash when mapped to 0x00000000
	if( is_flash )
		address_to_write |= 0x08000000;

	if( is_flash && MCF.BlockWrite64 && ( address_to_write & 0x3f ) == 0 && ( blob_size & 0x3f ) == 0 )
	{
		int i;
		fprintf(stderr, "BlockWrite64 pre\n");
		for( i = 0; i < blob_size; i+= CHUNKSIZE )
		{
			int r = MCF.BlockWrite64( dev, address_to_write + i, blob + i );
			if( r )
			{
				fprintf( stderr, "Error writing block at memory %08x / Error: %d\n", address_to_write, r );
				return r;
			}
		}
		return 0;
	}

	if( is_flash && !iss->flash_unlocked )
	{
		if( ( rw = StaticUnlockFlash( dev, iss ) ) )
			return rw;
	}


	uint8_t tempblock[CHUNKSIZE];
	int sblock =  address_to_write / CHUNKSIZE;
	int eblock = ( address_to_write + blob_size + (CHUNKSIZE - 1)) / CHUNKSIZE;
	int b;
	int rsofar = 0;

	for( b = sblock; b < eblock; b++ )
	{
		int offset_in_block = address_to_write - (b * CHUNKSIZE);
		if( offset_in_block < 0 ) offset_in_block = 0;
		int end_o_plus_one_in_block = ( address_to_write + blob_size ) - (b*CHUNKSIZE);
		if( end_o_plus_one_in_block > CHUNKSIZE ) end_o_plus_one_in_block = CHUNKSIZE;
		int	base = b * CHUNKSIZE;

		fprintf(stderr, "base: %x\n", base);

		if( offset_in_block == 0 && end_o_plus_one_in_block == CHUNKSIZE )
		{
			fprintf(stderr, "We're at non wacky mode\n");
			if( MCF.BlockWrite64 ) 
			{
				fprintf(stderr, "The wackbittinness is 64\n");
				int r = MCF.BlockWrite64( dev, base, blob + rsofar );
				rsofar += CHUNKSIZE;
				if( r )
				{
					fprintf( stderr, "Error writing block at memory %08x (error = %d)\n", base, r );
					return r;
				}
			}
			else 					// Block Write not avaialble
			{
				fprintf(stderr, "The wackbittinness is wordy\n");
				if( is_flash )
				{
					fprintf(stderr, "Section A\n");
					MCF.Erase( dev, base, CHUNKSIZE, 0 );
					MCF.WriteWord( dev, 0x40022010, CR_PAGE_PG ); // THIS IS REQUIRED, (intptr_t)&FLASH->CTLR = 0x40022010
					MCF.WriteWord( dev, 0x40022010, CR_BUF_RST | CR_PAGE_PG );  // (intptr_t)&FLASH->CTLR = 0x40022010
					if( MCF.WaitForFlash ) MCF.WaitForFlash( dev );
				}

				int j;
				for( j = 0; j < (CHUNKSIZE / 4); j++ )
				{
					uint32_t writeword;
					memcpy( &writeword, blob + rsofar, 4 );
					MCF.WriteWord( dev, j*4+base, writeword );
					fprintf(stderr, "Section B -> j84+base: %x rsofar: %x j: %x\n", j*4+base, rsofar, j);
					rsofar += 4;
					if( MCF.WaitForFlashFastProg ) MCF.WaitForFlashFastProg( dev );
				}

				if( is_flash )
				{
					fprintf(stderr, "Section C\n");
					MCF.WriteWord( dev, 0x40022014, base );  //0x40022014 -> FLASH->ADDR
					MCF.WriteWord( dev, 0x40022010, CR_PAGE_PG|CR_STRT_Set ); // 0x40022010 -> FLASH->CTLR
					if( MCF.WaitForFlash ) MCF.WaitForFlash( dev );
					MCF.WriteWord(dev, (intptr_t)&FLASH->STATR, 0);
				}
			}
		}
		else
		{
			//Ok, we have to do something wacky.
			fprintf(stderr, "We're at wacky mode\n");
			break;
			if( is_flash )
			{
				MCF.ReadBinaryBlob( dev, base, CHUNKSIZE, tempblock );

				// Permute tempblock
				int tocopy = end_o_plus_one_in_block - offset_in_block;
				memcpy( tempblock + offset_in_block, blob + rsofar, tocopy );
				fprintf(stderr, "tocopy: %x\n", tocopy);
				rsofar += tocopy;

				if( MCF.BlockWrite64 ) 
				{
					int r = MCF.BlockWrite64( dev, base, tempblock );
					if( r ) return r;
				}
				else
				{
					MCF.Erase( dev, base, CHUNKSIZE, 0 );
					MCF.WriteWord( dev, 0x40022010, CR_PAGE_PG ); // THIS IS REQUIRED, (intptr_t)&FLASH->CTLR = 0x40022010
					MCF.WriteWord( dev, 0x40022010, CR_BUF_RST | CR_PAGE_PG );  // (intptr_t)&FLASH->CTLR = 0x40022010
					
					int j;
					for( j = 0; j < CHUNKSIZE / 4; j++ )
					{
						fprintf(stderr, "Section WackyB -> j84+base: %x rsofar: %x j: %x\n", j*4+base, rsofar, j);
						MCF.WriteWord( dev, j*4+base, *(uint32_t*)(tempblock + j * 4) );
						rsofar += 4;
						if( MCF.WaitForFlashFastProg ) MCF.WaitForFlashFastProg( dev );
					}
					MCF.WriteWord( dev, 0x40022014, base );  //0x40022014 -> FLASH->ADDR
					MCF.WriteWord( dev, 0x40022010, CR_PAGE_PG|CR_STRT_Set ); // 0x40022010 -> FLASH->CTLR
				}

				fprintf(stderr, "About to wait for flash...\n");
				
				break;

